/*
ДЗ 7.3. Функція з циклом

Цикл на кожній ітерації пропонує через prompt ввести число більше 100 (але максимум 10 ітерацій циклу).
Якщо відвідувач ввів число менше ста – попросити ввести ще раз, і таке інше.
Якщо користувач вводить більше ста, текст або цикл закінчує всі ітерації, то
функція виводить в консоль останній введення користувача і завершує функцію.

*/

function enterNumber() {

  const minNumber = 100;
  let numb = Number(prompt("Введите число больше 100"))

  if (numb < minNumber || isNaN(numb) || numb === null) {
    for (let i = 1; i <= 10; i++) {
      numb = Number(prompt("Еще раз попробуйте ввести число больше 100"))

      if (numb > minNumber) {
        console.log(`Вы ввели число ${numb}`)
        break;
      }
    }
  } else {
    console.log(`Вы ввели число ${numb}`)
  }
}
  

enterNumber()
