/*
ДЗ 12.2. Використання подій

Створіть HTML-сторінку з декількома кнопками. Ваше завдання - створити обробник подій для батьківського елементу, який відслідковуватиме кліки на всіх кнопках.

Покроковий план:

1. Створіть HTML-елементи: батьківський контейнер з декількома вкладеними кнопками.
2. Додайте обробник подій до батьківського контейнера, який відслідковуватиме кліки.
3. Після кліку на будь-якій кнопці, виведіть повідомлення про те, яка саме кнопка була клікнута.
*/

const parent = document.querySelector('.parent');

parent.addEventListener('click', getButtonMessage);

function getButtonMessage(event) {

  if (event.target.textContent === 'Кнопка 1') {
    alert('Нажата кнопка 1')
  } else if (event.target.textContent === 'Кнопка 2') {
    alert('Нажата кнопка 2')
  } else if (event.target.textContent === 'Кнопка 3') {
    alert('Нажата кнопка 3')
  }

}